In [2]:
import pandas as pd
import sqlite3
import seaborn as sns
import numpy as np
sns.set_theme(style="whitegrid")

In [3]:
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [4]:
clientsdf = pd.read_csv('./source_csv/clients.csv', sep=";")

In [5]:
clientsdf.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [6]:
clientsdf.tail()

     client_id sex  birth
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

In [7]:
productsdf = pd.read_csv('./source_csv/produits_sous-categorie.csv', sep=',')

In [8]:
productsdf.head()

  product_id     category sub_category  price  stock_quantity
0     0_1421    Vêtements     T-shirts  19.99              39
1     0_1368    Vêtements     T-shirts   5.13              76
2      0_731    Vêtements     T-shirts  17.99               2
3      1_587  Accessoires  Sacs à main   4.99              55
4     0_1507    Vêtements     T-shirts   3.99              81

In [9]:
ventesdf = pd.read_csv('./source_csv/ventes.csv')

In [10]:
clientsdf

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8623 rows x 3 columns]

In [11]:
#Nombre de lignes et col

clientsdf.shape

(8623, 3)

In [12]:
ventesdf.head()

  id_prod                        date session_id client_id  quantity_sold
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450              5
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277              6
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270              3
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597              8
4  0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242              2

In [13]:
clientsdf.tail()

     client_id sex  birth
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

In [14]:
clientsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [15]:
ventesdf.describe()

       quantity_sold
count  337016.000000
mean        5.498522
std         2.874598
min         1.000000
25%         3.000000
50%         5.000000
75%         8.000000
max        10.000000

In [16]:
#Analyse

def info(df):
    print('info')
    print(clientsdf.info())
    print('------------')
    print('describe')
    print(clientsdf.describe())
    print('------------')
    print('nunique')
    print(clientsdf.nunique())
    print('------------------------------------------------')
    print('max')
    print(clientsdf.max())
    print('------------------------------------------------')
    print('min')
    print(clientsdf.min())
    print('------------------------------------------------')
    print('preview uniques')
    for i in clientsdf:
        uni =clientsdf[i].unique()
        print(i)
        print(uni)

In [17]:
info(ventesdf)

info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB
None
------------
describe
             birth
count  8623.000000
mean   1977.816769
std      46.071018
min   -2001.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000
------------
nunique
client_id    8623
sex             2
birth          77
dtype: int64
------------------------------------------------
max
client_id    ct_1
sex             m
birth        2004
dtype: object
------------------------------------------------
min
client_id      c_1
sex              f
birth        -2001
dtype: object
------------------------------------------------
preview uniques
client_id
['c_4410' 'c_7839' 'c_1699' ... 'c_5119' 'c_5643' 'c_84']
sex
['f' 'm']
birth
[ 1967  1975  1984  1962  1943  1993  1978  1971  1982  1945  2003  1959
  1977  1954  1987  2000  1992  1963  1958  1994  1936  1986  1942  1970
  1957  1968  2002  2004  1979  1974  1964  1951  1937  1981  1965  1960
  1996  1983  1990  1955  1988  1991  1972  1980  1989  1976  1985  1953
  1998  1956  1948  1973  1969  1938  1995  1952  1949  1999  2001  1939
  1950  1966  1935  1941  1961  1997  1944  1929  1947  1946  1932  1931
  1933  1930  1940  1934 -2001]

In [24]:
info(productsdf)

info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB
None
------------
describe
             birth
count  8623.000000
mean   1977.816769
std      46.071018
min   -2001.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000
------------
nunique
client_id    8623
sex             2
birth          77
dtype: int64
------------------------------------------------
max
client_id    ct_1
sex             m
birth        2004
dtype: object
------------------------------------------------
min
client_id      c_1
sex              f
birth        -2001
dtype: object
------------------------------------------------
preview uniques
client_id
['c_4410' 'c_7839' 'c_1699' ... 'c_5119' 'c_5643' 'c_84']
sex
['f' 'm']
birth
[ 1967  1975  1984  1962  1943  1993  1978  1971  1982  1945  2003  1959
  1977  1954  1987  2000  1992  1963  1958  1994  1936  1986  1942  1970
  1957  1968  2002  2004  1979  1974  1964  1951  1937  1981  1965  1960
  1996  1983  1990  1955  1988  1991  1972  1980  1989  1976  1985  1953
  1998  1956  1948  1973  1969  1938  1995  1952  1949  1999  2001  1939
  1950  1966  1935  1941  1961  1997  1944  1929  1947  1946  1932  1931
  1933  1930  1940  1934 -2001]

In [25]:
info(clientsdf)

info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB
None
------------
describe
             birth
count  8623.000000
mean   1977.816769
std      46.071018
min   -2001.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000
------------
nunique
client_id    8623
sex             2
birth          77
dtype: int64
------------------------------------------------
max
client_id    ct_1
sex             m
birth        2004
dtype: object
------------------------------------------------
min
client_id      c_1
sex              f
birth        -2001
dtype: object
------------------------------------------------
preview uniques
client_id
['c_4410' 'c_7839' 'c_1699' ... 'c_5119' 'c_5643' 'c_84']
sex
['f' 'm']
birth
[ 1967  1975  1984  1962  1943  1993  1978  1971  1982  1945  2003  1959
  1977  1954  1987  2000  1992  1963  1958  1994  1936  1986  1942  1970
  1957  1968  2002  2004  1979  1974  1964  1951  1937  1981  1965  1960
  1996  1983  1990  1955  1988  1991  1972  1980  1989  1976  1985  1953
  1998  1956  1948  1973  1969  1938  1995  1952  1949  1999  2001  1939
  1950  1966  1935  1941  1961  1997  1944  1929  1947  1946  1932  1931
  1933  1930  1940  1934 -2001]

In [18]:
print(productsdf.shape)

(3287, 5)

In [19]:
ventesdf.shape

(337016, 5)

In [20]:
ventesdf

       id_prod                        date session_id client_id  quantity_sold
0       0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450              5
1        2_226  2022-02-03 01:55:53.276402   s_159142     c_277              6
2        1_374  2021-09-23 15:13:46.938559    s_94290    c_4270              3
3       0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597              8
4       0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242              2
...        ...                         ...        ...       ...            ...
337011   1_671  2021-05-28 12:35:46.214839    s_40720    c_3454              1
337012   0_759  2021-06-19 00:19:23.917703    s_50568    c_6268             10
337013  0_1256  2021-03-16 17:31:59.442007     s_7219    c_4137              7
337014   2_227  2021-10-30 16:50:15.997750   s_112349       c_5              8
337015  0_1417  2021-06-26 14:38:19.732946    s_54117    c_6714              3

[337016 rows x 5 columns]

In [29]:
#identifié les valeurs manquantes
print(productsdf.isnull().sum())
print(clientsdf.isnull().sum())
print(ventesdf.isnull().sum())

product_id        0
category          0
sub_category      0
price             0
stock_quantity    0
dtype: int64
client_id    0
sex          0
birth        0
dtype: int64
id_prod          0
date             0
session_id       0
client_id        0
quantity_sold    0
dtype: int64

In [28]:
#Vérifier les doublons 

print(productsdf.duplicated().sum())
print(clientsdf.duplicated().sum())
print(ventesdf.duplicated().sum())

0
0
18

In [23]:
productsdf_clean = productsdf.drop_duplicates()
clientsdf_clean =  clientsdf.drop_duplicates()
ventesdf_clean = ventesdf.drop_duplicates()

productsdf_clean.duplicated().sum()
clientsdf_clean.duplicated().sum()
ventesdf_clean.duplicated().sum()

np.int64(0)

- enlever les id type string 
- enlever les caractères speciaux
-

In [30]:
#TEST POUR GIT
productsdf_clean.dtypes

product_id         object
category           object
sub_category       object
price             float64
stock_quantity      int64
dtype: object

In [32]:
#Vérifier les prix négatifs

inv_prices = productsdf_clean[productsdf_clean['price'] < 0]
print("prix negatif:\n" , inv_prices)

prix negatif:
     product_id   category sub_category  price  stock_quantity
731        T_0  Vêtements     T-shirts   -1.0              89